### Pandas for Data Science

    - Pandas Series
    - Pandas Data Frame

In [93]:
import pandas as pd
pd.__version__

'1.0.5'

#### Series

In [94]:
import numpy as np

In [95]:
# Consider as a single column of a spreadsheet
# each entry in a series corresponds to an individual row in the spreadsheet
# we can create a series by converting a list, or numpy array

mylist = [5.4,6.1,1.7,99.8]
myarray = np.array(mylist)

In [96]:
series1 = pd.Series(data=mylist)
print(series1)
series2 = pd.Series(data=myarray)
print(series2)

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64
0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64

In [97]:
series1 = pd.Series(data=mylist,name="Example Series")
print(series1)

0     5.4
1     6.1
2     1.7
3    99.8
Name: Example Series, dtype: float64

In [98]:
# Accessing the entries
print(series1[3])

99.8

In [99]:
# we can add labels to the entries of a series

mylabels = ['first','second','third','fourth']
series3 = pd.Series(data=mylist,index=mylabels,name="Series 3")
print(series3)

first      5.4
second     6.1
third      1.7
fourth    99.8
Name: Series 3, dtype: float64

In [100]:
series4 = pd.Series(mylist,mylabels)
print(series4)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [101]:
# we can also access entries using the index labels
print(series4['fourth'])

99.8

In [102]:
print(series4[2])

1.7

In [103]:
# we can do math on series 
series5 = pd.Series([5.5,1.1,8.8,1.6],['first','third','fourth','fifth'])
print(series5)

first     5.5
third     1.1
fourth    8.8
fifth     1.6
dtype: float64

In [104]:
series4

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [105]:
series4+series5

fifth       NaN
first      10.9
fourth    108.6
second      NaN
third       2.8
dtype: float64

### DataFrame
- has more than 1 series
- Row column structure like excel sheet

In [106]:
# we can combine series to create a dataframe using the concat function
df_1 = pd.concat([series4,series5],axis=1,sort=False)
df_1

           0    1
first    5.4  5.5
second   6.1  NaN
third    1.7  1.1
fourth  99.8  8.8
fifth    NaN  1.6

In [107]:
# we can create a new dataframe 
df_2 = pd.DataFrame(data = np.random.randint(-10,25,(5,5)))
df_2

    0   1   2   3   4
0  15   7   8  17   9
1  -8  15  -8  20  17
2   4  18  -2   2  13
3  12  -8  -1  -5  22
4 -10  13  16  -9  16

In [108]:
# lets give labels to rows and columns
df_3 = pd.DataFrame(np.random.randint(-10,25,(5,5)),
                    index=['first row','second row','third row','fourth row','fifth row'],
                   columns=['first col','second col','third col','fourth col','fifth col'])
df_3

            first col  second col  third col  fourth col  fifth col
first row          19          -3          8          10         -9
second row          3          -4          3          17          1
third row          -2          24         14          -9         -1
fourth row         19          -3         17           6         21
fifth row           1          -2         17          10         17

In [109]:
print(df_3['second col'])

first row     -3
second row    -4
third row     24
fourth row    -3
fifth row     -2
Name: second col, dtype: int32

In [110]:
# we can access individual series in a data frame
print(df_3['second col']) # each column refer to series
print('\n')
df_3[['third col','first col']]

first row     -3
second row    -4
third row     24
fourth row    -3
fifth row     -2
Name: second col, dtype: int32

            third col  first col
first row           8         19
second row          3          3
third row          14         -2
fourth row         17         19
fifth row          17          1

In [111]:
#iloc & loc attribute

In [112]:
df_3

            first col  second col  third col  fourth col  fifth col
first row          19          -3          8          10         -9
second row          3          -4          3          17          1
third row          -2          24         14          -9         -1
fourth row         19          -3         17           6         21
fifth row           1          -2         17          10         17

In [113]:
# we can access rows of a dataframe
df_3.loc['fourth row']

first col     19
second col    -3
third col     17
fourth col     6
fifth col     21
Name: fourth row, dtype: int32

In [114]:
df_3.loc["fifth row"]

first col      1
second col    -2
third col     17
fourth col    10
fifth col     17
Name: fifth row, dtype: int32

In [115]:
df_3.iloc[2]

first col     -2
second col    24
third col     14
fourth col    -9
fifth col     -1
Name: third row, dtype: int32

In [116]:
df_3.loc[['fourth row','first row'],['second col','third col']]

            second col  third col
fourth row          -3         17
first row           -3          8

In [117]:
df_3.loc["first row","third col"]

8

In [118]:
df_3.iloc[1,2]

3

---

In [119]:
df_3

            first col  second col  third col  fourth col  fifth col
first row          19          -3          8          10         -9
second row          3          -4          3          17          1
third row          -2          24         14          -9         -1
fourth row         19          -3         17           6         21
fifth row           1          -2         17          10         17

In [120]:
# we can use logical indexing for dataframes just like for numpy arrays
df_3>0

            first col  second col  third col  fourth col  fifth col
first row        True       False       True        True      False
second row       True       False       True        True       True
third row       False        True       True       False      False
fourth row       True       False       True        True       True
fifth row        True       False       True        True       True

In [121]:
df_3[df_3>0]

            first col  second col  third col  fourth col  fifth col
first row        19.0         NaN          8        10.0        NaN
second row        3.0         NaN          3        17.0        1.0
third row         NaN        24.0         14         NaN        NaN
fourth row       19.0         NaN         17         6.0       21.0
fifth row         1.0         NaN         17        10.0       17.0

In [122]:
# we can add columns to a dataframe
df_3['sixth col'] = np.random.randint(-100,100,(5,1))
df_3

            first col  second col  third col  fourth col  fifth col  sixth col
first row          19          -3          8          10         -9          7
second row          3          -4          3          17          1         89
third row          -2          24         14          -9         -1         27
fourth row         19          -3         17           6         21        -88
fifth row           1          -2         17          10         17        -87

In [123]:
# we can remove columns or rows from a dataframe
df_3.drop('first col',axis=1)

            second col  third col  fourth col  fifth col  sixth col
first row           -3          8          10         -9          7
second row          -4          3          17          1         89
third row           24         14          -9         -1         27
fourth row          -3         17           6         21        -88
fifth row           -2         17          10         17        -87

In [124]:
#inplace as true
df_10 = df_3.copy()
df_10

            first col  second col  third col  fourth col  fifth col  sixth col
first row          19          -3          8          10         -9          7
second row          3          -4          3          17          1         89
third row          -2          24         14          -9         -1         27
fourth row         19          -3         17           6         21        -88
fifth row           1          -2         17          10         17        -87

In [125]:
df_10.drop("first col",axis= 1,inplace = True)

In [126]:
df_10

            second col  third col  fourth col  fifth col  sixth col
first row           -3          8          10         -9          7
second row          -4          3          17          1         89
third row           24         14          -9         -1         27
fourth row          -3         17           6         21        -88
fifth row           -2         17          10         17        -87

In [127]:
df_3

            first col  second col  third col  fourth col  fifth col  sixth col
first row          19          -3          8          10         -9          7
second row          3          -4          3          17          1         89
third row          -2          24         14          -9         -1         27
fourth row         19          -3         17           6         21        -88
fifth row           1          -2         17          10         17        -87

In [128]:
df_4 = df_3.drop('first col',axis=1)
df_4

            second col  third col  fourth col  fifth col  sixth col
first row           -3          8          10         -9          7
second row          -4          3          17          1         89
third row           24         14          -9         -1         27
fourth row          -3         17           6         21        -88
fifth row           -2         17          10         17        -87

In [129]:
df_5 = df_3.drop('second row',axis=0)
df_5

            first col  second col  third col  fourth col  fifth col  sixth col
first row          19          -3          8          10         -9          7
third row          -2          24         14          -9         -1         27
fourth row         19          -3         17           6         21        -88
fifth row           1          -2         17          10         17        -87

In [130]:
# we can remove a dataframe's index labels
df_5.reset_index()

,index,first col,second col,third col,fourth col,fifth col,sixth col
0,first row,19,-3,8,10,-9,7
1,third row,-2,24,14,-9,-1,27
2,fourth row,19,-3,17,6,21,-88
3,fifth row,1,-2,17,10,17,-87

In [131]:
df_5

            first col  second col  third col  fourth col  fifth col  sixth col
first row          19          -3          8          10         -9          7
third row          -2          24         14          -9         -1         27
fourth row         19          -3         17           6         21        -88
fifth row           1          -2         17          10         17        -87

In [132]:
df_5.reset_index(inplace=True)
df_5

,index,first col,second col,third col,fourth col,fifth col,sixth col
0,first row,19,-3,8,10,-9,7
1,third row,-2,24,14,-9,-1,27
2,fourth row,19,-3,17,6,21,-88
3,fifth row,1,-2,17,10,17,-87

In [133]:
# we can assign new names to the index
df_5['new name'] = ['This','is','the','row']
df_5

,index,first col,second col,third col,fourth col,fifth col,sixth col,new name
0,first row,19,-3,8,10,-9,7,This
1,third row,-2,24,14,-9,-1,27,is
2,fourth row,19,-3,17,6,21,-88,the
3,fifth row,1,-2,17,10,17,-87,row

In [134]:
df_5.set_index('new name',inplace=True)
df_5

,index,first col,second col,third col,fourth col,fifth col,sixth col
new name,,,,,,,
This,first row,19,-3,8,10,-9,7
is,third row,-2,24,14,-9,-1,27
the,fourth row,19,-3,17,6,21,-88
row,fifth row,1,-2,17,10,17,-87

# Combining data frames

The ways dataframes are combined in pandas is similar to SQL

We will examine 3 methods for combining dataframes

1. concat
2. join
3. merge

In [135]:
df_7 = pd.DataFrame({"customer":['1001','1002','1003','1004'], 
                    'category': ['cat3','cat1','cat1','cat2'],
                    'important': ['yes','no','yes','yes'],
                    'sales': [123,52,214,663]},index=[0,1,2,3])

df_8 = pd.DataFrame({"customer":['1001','1003','1004','1005'], 
                    'color': ['yellow','green','green','blue'],
                    'distance': [22,19,24,28],
                    'sales': [123,214,663,331]},index=[4,5,6,7])

In [136]:
df_7

  customer category important  sales
0     1001     cat3       yes    123
1     1002     cat1        no     52
2     1003     cat1       yes    214
3     1004     cat2       yes    663

In [137]:
df_8

  customer   color  distance  sales
4     1001  yellow        22    123
5     1003   green        19    214
6     1004   green        24    663
7     1005    blue        28    331

In [138]:
pd.concat([df_7,df_8],axis=0,sort=False)

  customer category important  sales   color  distance
0     1001     cat3       yes    123     NaN       NaN
1     1002     cat1        no     52     NaN       NaN
2     1003     cat1       yes    214     NaN       NaN
3     1004     cat2       yes    663     NaN       NaN
4     1001      NaN       NaN    123  yellow      22.0
5     1003      NaN       NaN    214   green      19.0
6     1004      NaN       NaN    663   green      24.0
7     1005      NaN       NaN    331    blue      28.0

In [139]:
pd.concat([df_7,df_8],axis=0,sort=True)

  category   color customer  distance important  sales
0     cat3     NaN     1001       NaN       yes    123
1     cat1     NaN     1002       NaN        no     52
2     cat1     NaN     1003       NaN       yes    214
3     cat2     NaN     1004       NaN       yes    663
4      NaN  yellow     1001      22.0       NaN    123
5      NaN   green     1003      19.0       NaN    214
6      NaN   green     1004      24.0       NaN    663
7      NaN    blue     1005      28.0       NaN    331

In [140]:
pd.concat([df_7,df_8],axis=1,sort=False)

  customer category important  sales customer   color  distance  sales
0     1001     cat3       yes  123.0      NaN     NaN       NaN    NaN
1     1002     cat1        no   52.0      NaN     NaN       NaN    NaN
2     1003     cat1       yes  214.0      NaN     NaN       NaN    NaN
3     1004     cat2       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN     1001  yellow      22.0  123.0
5      NaN      NaN       NaN    NaN     1003   green      19.0  214.0
6      NaN      NaN       NaN    NaN     1004   green      24.0  663.0
7      NaN      NaN       NaN    NaN     1005    blue      28.0  331.0

# Merge and Join

Merge combines dataframes using a column's values to identify common entries

Join combines dataframes using the index to identify common entries

In [141]:
pd.merge(df_7,df_8,how='outer',on='customer') # outer merge is union of on

  customer category important  sales_x   color  distance  sales_y
0     1001     cat3       yes    123.0  yellow      22.0    123.0
1     1002     cat1        no     52.0     NaN       NaN      NaN
2     1003     cat1       yes    214.0   green      19.0    214.0
3     1004     cat2       yes    663.0   green      24.0    663.0
4     1005      NaN       NaN      NaN    blue      28.0    331.0

In [142]:
pd.merge(df_7,df_8,how='inner',on='customer') # inner merge is intersection of on

  customer category important  sales_x   color  distance  sales_y
0     1001     cat3       yes      123  yellow        22      123
1     1003     cat1       yes      214   green        19      214
2     1004     cat2       yes      663   green        24      663

In [143]:
pd.merge(df_7,df_8,how='right',on='customer') # left merge is just first on, but all columns ... right is second

  customer category important  sales_x   color  distance  sales_y
0     1001     cat3       yes    123.0  yellow        22      123
1     1003     cat1       yes    214.0   green        19      214
2     1004     cat2       yes    663.0   green        24      663
3     1005      NaN       NaN      NaN    blue        28      331

In [144]:
pd.merge(df_7,df_8,how='left',on='customer') # left merge is just first on, but all columns ... right is second

  customer category important  sales_x   color  distance  sales_y
0     1001     cat3       yes      123  yellow      22.0    123.0
1     1002     cat1        no       52     NaN       NaN      NaN
2     1003     cat1       yes      214   green      19.0    214.0
3     1004     cat2       yes      663   green      24.0    663.0

In [145]:
df_9 = pd.DataFrame({'A1': [201,202,203],
                    'A2': [301,302,303]},
                   index=['I0','I1','I2'])

df_10 = pd.DataFrame({'A3': [401,402,403],
                    'A4': [501,502,503]},
                   index=['I0','I2','I3'])

In [146]:
# join behaves just like merge, 
# except instead of using the values of one of the columns 
# to combine data frames, it uses the index labels
df_9.join(df_10,how='outer')

       A1     A2     A3     A4
I0  201.0  301.0  401.0  501.0
I1  202.0  302.0    NaN    NaN
I2  203.0  303.0  402.0  502.0
I3    NaN    NaN  403.0  503.0

In [147]:
df_9.join(df_10,how='inner')

     A1   A2   A3   A4
I0  201  301  401  501
I2  203  303  402  502

---

#### Other Functions

In [148]:
df_8

  customer   color  distance  sales
4     1001  yellow        22    123
5     1003   green        19    214
6     1004   green        24    663
7     1005    blue        28    331

In [149]:
df_8.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 4 to 7
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   customer  4 non-null      object
 1   color     4 non-null      object
 2   distance  4 non-null      int64
 3   sales     4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [150]:
# let's now go over a few more basic functialities of pandas
df_8['color'].unique()

array(['yellow', 'green', 'blue'], dtype=object)

In [151]:
df_8.color

4    yellow
5     green
6     green
7      blue
Name: color, dtype: object

In [152]:
df_8

  customer   color  distance  sales
4     1001  yellow        22    123
5     1003   green        19    214
6     1004   green        24    663
7     1005    blue        28    331

In [153]:
df_8['color'].value_counts()

green     2
blue      1
yellow    1
Name: color, dtype: int64

In [154]:
df_8["sales"].mean()

332.75

In [155]:
df_9

     A1   A2
I0  201  301
I1  202  302
I2  203  303

In [156]:
df_9.mean()

A1    202.0
A2    302.0
dtype: float64

In [157]:
df_8

  customer   color  distance  sales
4     1001  yellow        22    123
5     1003   green        19    214
6     1004   green        24    663
7     1005    blue        28    331

In [158]:
df_8.mean()

customer    2.502751e+14
distance    2.325000e+01
sales       3.327500e+02
dtype: float64

In [159]:
df_8.columns

Index(['customer', 'color', 'distance', 'sales'], dtype='object')

In [160]:
df_8

  customer   color  distance  sales
4     1001  yellow        22    123
5     1003   green        19    214
6     1004   green        24    663
7     1005    blue        28    331

In [161]:
new_df = df_8[(df_8['customer']!='1005') & (df_8['color']!='blue')] 
new_df

  customer   color  distance  sales
4     1001  yellow        22    123
5     1003   green        19    214
6     1004   green        24    663

In [162]:
(df_8['customer']!='1005')

4     True
5     True
6     True
7    False
Name: customer, dtype: bool

In [163]:
(df_8['color']!='blue')

4     True
5     True
6     True
7    False
Name: color, dtype: bool

In [164]:
(df_8['customer']!='1005') & (df_8['color']!='blue')

4     True
5     True
6     True
7    False
dtype: bool

In [165]:
new_df = df_8[(df_8['customer']!='1005') & (df_8['color']!='green')] 
new_df

  customer   color  distance  sales
4     1001  yellow        22    123

In [166]:
# | to bitwise or

In [167]:
print(df_8['sales'].sum())
print(df_8['distance'].min())

1331
19

In [ ]:
print(df_8['distance'].max())

In [168]:
def multiply(s):
    return s*2 # 2 times

In [169]:
df_8

  customer   color  distance  sales
4     1001  yellow        22    123
5     1003   green        19    214
6     1004   green        24    663
7     1005    blue        28    331

In [170]:
df_8['sales'].apply(multiply)

4     246
5     428
6    1326
7     662
Name: sales, dtype: int64

In [171]:
df_8

  customer   color  distance  sales
4     1001  yellow        22    123
5     1003   green        19    214
6     1004   green        24    663
7     1005    blue        28    331

In [172]:
df_8["new sales"] = df_8['sales'].apply(multiply)
df_8

  customer   color  distance  sales  new sales
4     1001  yellow        22    123        246
5     1003   green        19    214        428
6     1004   green        24    663       1326
7     1005    blue        28    331        662

In [173]:
df_11 = df_8[['distance','sales']]
df_11.applymap(multiply)

   distance  sales
4        44    246
5        38    428
6        48   1326
7        56    662

In [174]:
df_11

   distance  sales
4        22    123
5        19    214
6        24    663
7        28    331

In [175]:
df_8

  customer   color  distance  sales  new sales
4     1001  yellow        22    123        246
5     1003   green        19    214        428
6     1004   green        24    663       1326
7     1005    blue        28    331        662

In [176]:
del df_8['color']
df_8

  customer  distance  sales  new sales
4     1001        22    123        246
5     1003        19    214        428
6     1004        24    663       1326
7     1005        28    331        662

In [177]:
df_8.sort_values(by='distance',inplace=True)
df_8

  customer  distance  sales  new sales
5     1003        19    214        428
4     1001        22    123        246
6     1004        24    663       1326
7     1005        28    331        662

In [178]:
df_8.sort_values(by='distance',inplace=True,ascending=False)
df_8

  customer  distance  sales  new sales
7     1005        28    331        662
6     1004        24    663       1326
4     1001        22    123        246
5     1003        19    214        428

In [ ]:
df_8

In [179]:
# if some series has multiple of the same value then we can group all the unique entries together
mydict = {'customer': ['Customer 1','Customer 1','Customer2','Customer2','Customer3','Customer3'], 
          'product1': [1.1,2.1,3.8,4.2,5.5,6.9],
          'product2': [8.2,9.1,11.1,5.2,44.66,983]}
df_6 = pd.DataFrame(mydict,index=['Purchase 1','Purchase 2','Purchase 3','Purchase 4','Purchase 5','Purchase 6'])
df_6

              customer  product1  product2
Purchase 1  Customer 1       1.1      8.20
Purchase 2  Customer 1       2.1      9.10
Purchase 3   Customer2       3.8     11.10
Purchase 4   Customer2       4.2      5.20
Purchase 5   Customer3       5.5     44.66
Purchase 6   Customer3       6.9    983.00

In [180]:
df_6["customer"].value_counts()

Customer2     2
Customer 1    2
Customer3     2
Name: customer, dtype: int64

In [181]:
grouped_data = df_6.groupby('customer')
print(grouped_data)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001E919EFB0A0>

In [182]:
grouped_data.std()

            product1    product2
customer
Customer 1  0.707107    0.636396
Customer2   0.282843    4.171930
Customer3   0.989949  663.506577

In [183]:
df_6

              customer  product1  product2
Purchase 1  Customer 1       1.1      8.20
Purchase 2  Customer 1       2.1      9.10
Purchase 3   Customer2       3.8     11.10
Purchase 4   Customer2       4.2      5.20
Purchase 5   Customer3       5.5     44.66
Purchase 6   Customer3       6.9    983.00

In [185]:
df_6.groupby('customer').mean()

            product1  product2
customer
Customer 1       1.6      8.65
Customer2        4.0      8.15
Customer3        6.2    513.83

In [184]:
df_6.groupby('customer').sum()

            product1  product2
customer
Customer 1       3.2     17.30
Customer2        8.0     16.30
Customer3       12.4   1027.66

In [186]:
df_8

  customer  distance  sales  new sales
7     1005        28    331        662
6     1004        24    663       1326
4     1001        22    123        246
5     1003        19    214        428

In [187]:
df_8.to_csv('df_8.csv',index=True)

In [188]:
new_df_8 = pd.read_csv('df_8.csv')
new_df_8

   Unnamed: 0  customer  distance  sales  new sales
0           7      1005        28    331        662
1           6      1004        24    663       1326
2           4      1001        22    123        246
3           5      1003        19    214        428

In [189]:
new_df_8 = pd.read_csv('df_8.csv',index_col=0)
new_df_8

   customer  distance  sales  new sales
7      1005        28    331        662
6      1004        24    663       1326
4      1001        22    123        246
5      1003        19    214        428

In [190]:
df_8.to_excel('df_8.xlsx',index=False,sheet_name='first sheet')
newer_df_8 = pd.read_excel('df_8.xlsx',sheet_name='first sheet',index_col=1)
newer_df_8

          customer  sales  new sales
distance
28            1005    331        662
24            1004    663       1326
22            1001    123        246
19            1003    214        428